**Missing values analysis**

- MVA very important in Data analysis

- It is quiet natural data set has missing values

- There are so many techniques are there

    - Mean
    
    - Median
    
    - Mode
    
    - bfill
    
    - ffill
    
    - pad
    
    - random values
    
    - You can compare column values and you can impute
    
    - KNN imputer

In [8]:
import pandas as pd
import numpy as np

In [27]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [12]:
d1.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [28]:
d1.isnull().sum()

Names    1
Ages     1
City     1
dtype: int64

In [15]:
dict2={'Names':['Ramesh','Suresh','Sathish','Null'],
       'Ages':[30,31,'Null',32],
       'City':['Null','Hyd','Pune','Chennai']}

d2=pd.DataFrame(dict2)
d2

     Names  Ages     City
0   Ramesh    30     Null
1   Suresh    31      Hyd
2  Sathish  Null     Pune
3     Null    32  Chennai

In [16]:
d2.isnull()

   Names   Ages   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [18]:
dict3={'Names':['Ramesh','Suresh','Sathish',None],
       'Ages':[30,31,None,32],
       'City':[None,'Hyd','Pune','Chennai']}

d3=pd.DataFrame(dict3)
d3

     Names  Ages     City
0   Ramesh  30.0     None
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3     None  32.0  Chennai

In [19]:
d3.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

- np.nan

- None is working

- Some times when you read csv if you have missing values , it shows as Null

- isnull()

**Method-1**

**Random fill**

In [23]:
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [24]:
d1.fillna(40,inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0       40
1   Suresh  31.0      Hyd
2  Sathish  40.0     Pune
3       40  32.0  Chennai

In [25]:
d1.dtypes

Names     object
Ages     float64
City      object
dtype: object

**Method-2**

**Fill the random values based on column**

In [29]:
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [30]:
d1['Ages'].fillna(40,inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  40.0     Pune
3      NaN  32.0  Chennai

**Method-3**

- Mean

- Median

- Mode

In [ ]:
# Read the data again

In [31]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

- Median doesnot get affected by outliers

- Mean affected by outliers

- If you have a data is there:
    
    - First check the outlier , by simple boxplot
    
    - You can check with created outlier function
    
    - If you feel there is outliers are there
    
    - Then fill missing values with Median

In [34]:
age_mean=d1['Ages'].mean()
age_mean

31.0

In [35]:
d1['Ages'].fillna(age_mean,inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3      NaN  32.0  Chennai

**Method-4**

- pad

- bfill

- ffill

- backfill

**pad**

In [45]:
# again read the data

dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [37]:
d1.fillna(method='pad')
# Names = 'Sathish'
# Ages = '31'
# City = NaN

# It is filling by previous value by Column reference
# For the column axis=1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

In [48]:
d1.fillna(method='pad',axis=1)

     Names     Ages     City
0   Ramesh     30.0     30.0
1   Suresh     31.0      Hyd
2  Sathish  Sathish     Pune
3      NaN     32.0  Chennai

**bfill**

In [49]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [50]:
d1.fillna(method='bfill')

     Names  Ages     City
0   Ramesh  30.0      Hyd
1   Suresh  31.0      Hyd
2  Sathish  32.0     Pune
3      NaN  32.0  Chennai

In [51]:
d1.fillna(method='bfill',axis=1)

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  Pune     Pune
3     32.0  32.0  Chennai

**ffill**

In [52]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [53]:
d1.fillna(method='ffill')

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

In [54]:
d1.fillna(method='ffill',axis=1)

     Names     Ages     City
0   Ramesh     30.0     30.0
1   Suresh     31.0      Hyd
2  Sathish  Sathish     Pune
3      NaN     32.0  Chennai

**Note**
- pad and ffill is same

- bfill and backfill both are same

**Categorical columns**

- Categorical column mainly does not have any meaning in dataframes

- If it is some text or sentence , you can find the meaning of the sentence

- For example Names column is there, Review column is there

- Because of only Name itself you cant judge the output

- But a Review can impact the output

- Generally if any naive names kind of columns we can fill in any way

- But if some columns impacting output, Yes we need to fill those columns

- with an idea about how that column is related with other columns

**Method-5**

**KNN imputer**

- KNN : K- nearest Neighbours
    
    - It is One of ML model to find the nearest solution based on distanc matrix
    
    - Instead of taking all the values of mean
    
    - Why cant we take neighbours mean of observations
    
    - Here first will choose neighbours
    
    - It will calculate mean of those neighbours and fill with that value
    
**Package name**: Sklearn.imputer
    
**Method name**: KnnImputer